## Programming for Data Analyis Project Semester (2) 2020
Brendan Ryan GMIT

I have picked on a real world phenomenon in my own professional life. This is what  is the likelyhood of a member of the financial institution I work in availing of a service (in this case take a loan), based on their age, sex and employment status and then look at the the type of product they normally borrow for.

I will be using the following variables

- AGE
- Gender
- Loan Category
- Employment Status

Import the required libraries
** Give brief descriptoin of what each library does..

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

Import our Data Set based on the output of ones years lending

In [2]:
import pandas as pd
df = pd.read_csv('test.csv')

Test that our data set has loaded
** note maybe add in here only to load some rows

In [3]:
df

,Financial Month,Age,Loan Interest Code Description,Gender,Employment Status
0,Jan-19,20,SECURED BY SAVINGS 6% APR,FEMALE,EMPLOYED FULL-TIME
1,Jan-19,21,NORMAL RATE 10.4% APR,Male,EMPLOYED PART-TIME
2,Jan-19,22,CONNECT FIRST TIME 7.12% APR,Male,EMPLOYED FULL-TIME
3,Jan-19,22,NORMAL RATE 10.4% APR,Male,EMPLOYED FULL-TIME
4,Jan-19,22,NORMAL RATE 10.4% APR,Male,UNEMPLOYED
...,...,...,...,...,...
4024,Dec-19,80,SPECIAL CAR RATE 8.5 APR,Male,RETIRED
4025,Dec-19,81,NORMAL RATE 10.4% APR,FEMALE,RETIRED
4026,Dec-19,82,NORMAL RATE 10.4% APR,FEMALE,RETIRED
4027,Dec-19,85,SECURED BY SAVINGS 6% APR,FEMALE,RETIRED
4028,Dec-19,89,SECURED BY SAVINGS 6% APR,FEMALE,OTHER

Test that our improted data looks ok by using df.head and df.tail

In [4]:
df.head()

,Financial Month,Age,Loan Interest Code Description,Gender,Employment Status
0,Jan-19,20,SECURED BY SAVINGS 6% APR,FEMALE,EMPLOYED FULL-TIME
1,Jan-19,21,NORMAL RATE 10.4% APR,Male,EMPLOYED PART-TIME
2,Jan-19,22,CONNECT FIRST TIME 7.12% APR,Male,EMPLOYED FULL-TIME
3,Jan-19,22,NORMAL RATE 10.4% APR,Male,EMPLOYED FULL-TIME
4,Jan-19,22,NORMAL RATE 10.4% APR,Male,UNEMPLOYED

In [5]:
df.tail()

,Financial Month,Age,Loan Interest Code Description,Gender,Employment Status
4024,Dec-19,80,SPECIAL CAR RATE 8.5 APR,Male,RETIRED
4025,Dec-19,81,NORMAL RATE 10.4% APR,FEMALE,RETIRED
4026,Dec-19,82,NORMAL RATE 10.4% APR,FEMALE,RETIRED
4027,Dec-19,85,SECURED BY SAVINGS 6% APR,FEMALE,RETIRED
4028,Dec-19,89,SECURED BY SAVINGS 6% APR,FEMALE,OTHER

Everything looks ok above we can see the shape of our dataframe is correct

Lets have a look at the typoe of varibales we have to work with using the df.dtypes funtion

In [6]:
df.dtypes

Financial Month                   object
Age                                int64
Loan Interest Code Description    object
Gender                            object
Employment Status                 object
dtype: object

Ok as we can see from above we are dealing with 2 varibales of type object and 1 variable of type int64

In [7]:
df.describe()

               Age
count  4029.000000
mean     45.386200
std      15.624687
min      19.000000
25%      32.000000
50%      44.000000
75%      57.000000
max      89.000000

ok as Age is our only colum of type integer it is the only one which will be returned for statistical values as shown above

lets have a look at df.info which is another usefulo tol to give us more info on our dataframe

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4029 entries, 0 to 4028
Data columns (total 5 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   Financial Month                 4029 non-null   object
 1   Age                             4029 non-null   int64
 2   Loan Interest Code Description  4029 non-null   object
 3   Gender                          4027 non-null   object
 4   Employment Status               4029 non-null   object
dtypes: int64(1), object(4)
memory usage: 157.5+ KB

look at making the Financial month a date time # help from https://https://pbpython.com/pandas_dtypes.html

In [9]:
#pd.to_datetime(df["Financial Month"]) - not working lets come back to this and research some more

Best practice convernt some of our data types into categories

In [19]:
df[["Gender", "Employment Status","Loan Interest Code Description"]] = df[["Gender", "Employment Status","Loan Interest Code Description"]].astype("category")
#df["Loan Interest Code Description"] = df["Loan Interest Code Description"].astype("category")
#df["Employment Status"] = df["Employment Status"].astype("category")

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4029 entries, 0 to 4028
Data columns (total 5 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   Financial Month                 4029 non-null   object
 1   Age                             4029 non-null   int64
 2   Loan Interest Code Description  4029 non-null   category
 3   Gender                          4027 non-null   category
 4   Employment Status               4029 non-null   category
dtypes: category(3), int64(1), object(1)
memory usage: 76.4+ KB